In [1]:
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
user = "postgres"
password = "changeme"
host = "localhost"
port = "5432" # 5432 for everyone else
db = "sql-challenge"
uri = f"postgresql+psycopg2://{user}:{password}@{host}:{port}/{db}"
uri

'postgresql+psycopg2://postgres:changeme@localhost:5432/sql-challenge'

In [3]:
engine = create_engine(uri)
conn=engine.connect()

In [4]:
list(engine.execute("SELECT * FROM employees where emp_no=499942"))

[(499942, '1963-01-10', 'April', 'Foolsday', 'F', '1997-02-10')]

In [5]:
data=pd.read_sql("""
                 SELECT s.salary,t.title 
FROM titles as t 
INNER JOIN salary as s 
ON s.emp_no=t.emp_no;
                 """,conn)
data.head()

   salary            title
0   60117  Senior Engineer
1   78228     Senior Staff
2   78228            Staff
3   72488         Engineer
4   42365            Staff

In [ ]:
data.set_index('title', inplace=True)
data.plot.bar()
plt.show()

In [ ]:
grouped_data=data.groupby(["title"])

In [ ]:
grouped_data.mean()

In [ ]:
y=grouped_data["salary"].mean()
y

In [ ]:
z=grouped_data["title"].unique()
z

In [ ]:
plt.bar(z,y,align="center")